#include "show_menu.h"

int main_menu() {
	system("cls");
	cout << "--------欢迎使用MJ牌通讯录管理系统--------" << endl;
	cout << "----------------------------------------" << endl;
	cout << "----1.添加联系人--------------" << endl;
	cout << "----2.显示联系人--------------" << endl;
	cout << "----3.删除联系人--------------" << endl;
	cout << "----4.查找联系人--------------" << endl;
	cout << "----5.修改联系人--------------" << endl;
	cout << "----6.清空联系人--------------" << endl;
	cout << "----7.退出通讯录--------------" << endl;
	cout << "-----------------------------" << endl;
	cout << "请输入选择的功能序号：";
	int number;
	cin >> number;
	return number;
}